In [30]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

from sqlalchemy import create_engine

In [31]:
# DSN format for database connections:  [protocol / database  name]://[username]:[password]@[hostname / ip]:[port]/[database name here]
#engine = create_engine("""postgresql://dsiga:dsi12ga2020@rds-postgressql-dsisql.cnsjk2lqasnt.us-west-2.rds.amazonaws.com:5432/myDatabase""") 
#engine = create_engine("""postgresql://postgres:dsi12ga2020@database-1.cnsjk2lqasnt.us-west-2.rds.amazonaws.com:5432/dsisql""")

engine = create_engine(""" """)

In [33]:
sql = """ select * from passengers
"""

df = pd.read_sql_query(sql, engine)
df.head()

ProgrammingError: (psycopg2.errors.UndefinedTable) relation "passengers" does not exist
LINE 1:  select * from passengers
                       ^

[SQL:  select * from passengers
]
(Background on this error at: http://sqlalche.me/e/f405)

In [34]:
engine.execute("""CREATE TABLE passengers(
id SERIAL PRIMARY KEY,
name text,
sex text,
age float,
sibsp integer,
parch integer)""")

In [35]:
sql = """ select * from passengers
"""

df = pd.read_sql_query(sql, engine)
df.head()

Empty DataFrame
Columns: [id, name, sex, age, sibsp, parch]
Index: []

In [36]:
connection = engine.raw_connection()
#creating coursor object
cursor=connection.cursor()

Exception during reset or similar
Traceback (most recent call last):
  File "/Users/gateam/anaconda3/lib/python3.7/site-packages/sqlalchemy/pool/base.py", line 680, in _finalize_fairy
    fairy._reset(pool)
  File "/Users/gateam/anaconda3/lib/python3.7/site-packages/sqlalchemy/pool/base.py", line 867, in _reset
    pool._dialect.do_rollback(self)
  File "/Users/gateam/anaconda3/lib/python3.7/site-packages/sqlalchemy/engine/default.py", line 500, in do_rollback
    dbapi_connection.rollback()
psycopg2.OperationalError: SSL SYSCALL error: Operation timed out

In [37]:
cursor.execute("""CREATE TABLE survival(
id SERIAL PRIMARY KEY,
survived integer)""")

cursor.execute("""CREATE TABLE tripInfo(
id SERIAL PRIMARY KEY,
pclass integer,
ticket text,
fare float,
cabin text,
embarked text)""")

connection.commit()

In [38]:
sql = """ select * from survival
"""

df = pd.read_sql_query(sql, engine)
df.head()

Empty DataFrame
Columns: [id, survived]
Index: []

In [39]:
# Copy data from csv files to tables:

with open('passengers.csv', 'r') as row:
    next(row)# Skip the header row.
    cursor.copy_from(row, 'passengers', sep=',')
    
with open('survival.csv', 'r') as row:
    next(row) 
    cursor.copy_from(row, 'survival', sep=',')

with open('trip_info.csv', 'r') as row:
    next(row)
    cursor.copy_from(row, 'tripInfo', sep=',')
    
connection.commit()

In [41]:
sql = """ select * from passengers
"""

df = pd.read_sql_query(sql, engine)
df.head()

,id,name,sex,age,sibsp,parch
0,1,Braund Mr. Owen Harris,male,22.0,1,0
1,2,Cumings Mrs. John Bradley (Florence Briggs Tha...,female,38.0,1,0
2,3,Heikkinen Miss. Laina,female,26.0,0,0
3,4,Futrelle Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0
4,5,Allen Mr. William Henry,male,35.0,0,0

In [42]:
sql= """ SELECT tablename 
FROM pg_catalog.pg_tables 
WHERE schemaname='public'"""


df = pd.read_sql_query(sql, engine)
df.head()

    tablename
0  passengers
1    survival
2    tripinfo

In [19]:
sql = """
SELECT "table_name", "data_type", "table_schema"
FROM INFORMATION_SCHEMA.COLUMNS
WHERE "table_schema" = 'public'
ORDER BY table_name  
"""
df = pd.read_sql_query(sql, engine)
df

    table_name         data_type table_schema
0   passengers  double precision       public
1   passengers           integer       public
2   passengers              text       public
3   passengers              text       public
4   passengers           integer       public
5   passengers           integer       public
6     survival           integer       public
7     survival           integer       public
8     tripinfo              text       public
9     tripinfo           integer       public
10    tripinfo              text       public
11    tripinfo  double precision       public
12    tripinfo           integer       public
13    tripinfo              text       public

In [20]:
sql = """
select DISTINCT Embarked from tripinfo
"""

df = pd.read_sql_query(sql, engine)
df.head()

  embarked
0        Q
1        C
2        S

In [22]:
sql = """
select DISTINCT pclass from tripinfo
"""

df = pd.read_sql_query(sql, engine)
df.head()

   pclass
0       1
1       3
2       2

In [23]:
pd.read_sql("SELECT * FROM passengers WHERE age<3", con=engine)

     id                              name     sex   age  sibsp  parch
0     8     Palsson Master. Gosta Leonard    male  2.00      3      1
1    17               Rice Master. Eugene    male  2.00      4      1
2    79      Caldwell Master. Alden Gates    male  0.83      0      2
3   120  Andersson Miss. Ellis Anna Maria  female  2.00      4      2
4   165       Panula Master. Eino Viljami    male  1.00      4      1
5   173       Johnson Miss. Eleanor Ileen  female  1.00      1      1
6   184          Becker Master. Richard F    male  1.00      2      1
7   206         Strom Miss. Telma Matilda  female  2.00      0      1
8   298       Allison Miss. Helen Loraine  female  2.00      1      2
9   306     Allison Master. Hudson Trevor    male  0.92      1      2
10  341     Navratil Master. Edmond Roger    male  2.00      1      1
11  382    "Nakid Miss. Maria (""Mary"")"  female  1.00      0      2
12  387    Goodwin Master. Sidney Leonard    male  1.00      5      2
13  470      Baclini Miss. Helene Barbara  female  0.75      2      1
14  480           Hirvonen Miss. Hildur E  female  2.00      0      1
15  531           Quick Miss. Phyllis May  female  2.00      1      1
16  643      Skoog Miss. Margit Elizabeth  female  2.00      3      2
17  645             Baclini Miss. Eugenie  female  0.75      2      1
18  756          Hamalainen Master. Viljo    male  0.67      1      1
19  789         Dean Master. Bertram Vere    male  1.00      1      2
20  804    Thomas Master. Assad Alexander    male  0.42      0      1
21  825       Panula Master. Urho Abraham    male  2.00      4      1
22  828              Mallet Master. Andre    male  1.00      0      2
23  832    Richards Master. George Sibley    male  0.83      1      1